app/Controllers/AjaxstudentController.php

INSERT INTO `students` (`name`, `email`, `phone`, `course`) VALUES ('Ut esse nobis nesci', 'Aute laboris est qua', 'Saepe perferendis na', 'Quam molestiae aut b')
---
    public function store()
    {
        $students = new Ajaxstudent;
        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone'),
            'course' => $this->request->getPost('course'),
        ];
        $students->save($data);

SELECT *
FROM `students`
---
    public function fetch()
    {
        $students = new Ajaxstudent();
        $data['students'] = $students->findAll();

SELECT *
FROM `students`
WHERE `students`.`id` = '3'
---
    public function view()
    {
        $students = new Ajaxstudent();
        $student_id = $this->request->getPost('stud_id');
        $data['students'] = $students->find($student_id);

SELECT *
FROM `students`
WHERE `students`.`id` = '1'
---
    public function edit()
    {
        $students = new Ajaxstudent();
        $student_id = $this->request->getPost('stud_id');
        $data['students'] = $students->find($student_id);

DELETE FROM `students`
WHERE `id` IN ('12')
---
    public function delete()
    {
        $student = new Ajaxstudent();
        $student->delete($this->request->getPost('stud_id'));